Revit 2026 API

# ParameterTypeIdAllowMultipleSelection Property

---

"Allow Multiple Selection": This is used by the UI to allow selection of multiple elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId AllowMultipleSelection { get; }
```
```vb
Public Shared ReadOnly Property AllowMultipleSelection As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ AllowMultipleSelection {
	ForgeTypeId^ get ();
}
```
```fsharp
static member AllowMultipleSelection : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace